Revit 2024 API
ReferenceWithContext Properties
The ReferenceWithContext type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Proximity
 The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace